# SQL Practice Problems

This workbook contains responses to SQL Practice Problems using the Northwind_SPP database and pandasql, which can treat pandas data frames as if they were tables and uses SQLite syntax.

## Setup

In [1]:
import pandas as pd
from pandasql import sqldf

## Import tables

In [104]:
#pwd
filepath = '/Users/shanecaglar/Desktop/SQL Practice Problems/'
Shippers = pd.read_csv(filepath + 'Shippers.csv')
Categories = pd.read_csv(filepath + 'Categories.csv')
Employees = pd.read_csv(filepath + 'Employees.csv',parse_dates=[5])
Orders = pd.read_csv(filepath + 'Orders.csv')
Suppliers = pd.read_csv(filepath + 'Suppliers.csv')
Products = pd.read_csv(filepath + 'Products.csv')

## 1. Return all the fields from all the Shippers table

In [17]:
query = """
        SELECT *
        FROM Shippers

        """
print(sqldf(query,locals()))

   ShipperID       CompanyName           Phone
0          1    Speedy Express  (503) 555-9831
1          2    United Package  (503) 555-3199
2          3  Federal Shipping  (503) 555-9931

## 2. Return the Category Name and Description fields from the Categories table

In [25]:
query = """
        SELECT 
            CategoryName,
            Description
        FROM Categories

        """
print(sqldf(query,locals()))

     CategoryName                                        Description
0       Beverages        Soft drinks, coffees, teas, beers, and ales
1      Condiments  Sweet and savory sauces, relishes, spreads, an...
2     Confections                Desserts, candies, and sweet breads
3  Dairy Products                                            Cheeses
4  Grains/Cereals                Breads, crackers, pasta, and cereal
5    Meat/Poultry                                     Prepared meats
6         Produce                          Dried fruit and bean curd
7         Seafood                                   Seaweed and fish

## 3. Return the First Name, Last Name and Hire Date for Sales Representatives

In [31]:
query = """
        SELECT 
            FirstName,
            LastName,
            HireDate
        FROM Employees
        WHERE Title = 'Sales Representative'

        """
print(sqldf(query,locals()))

  FirstName   LastName       HireDate
0     Nancy    Davolio    1/5/10 0:00
1     Janet  Leverling    1/4/10 0:00
2  Margaret    Peacock    3/5/11 0:00
3   Michael     Suyama  17/10/11 0:00
4    Robert       King    2/1/12 0:00
5      Anne  Dodsworth  15/11/12 0:00

## 4. Return the First Name, Last Name and Hire Date for Sales Representatives in the United States

In [33]:
query = """
        SELECT 
            FirstName,
            LastName,
            HireDate
        FROM Employees
        WHERE Title = 'Sales Representative' AND Country = 'USA'

        """
print(sqldf(query,locals()))

  FirstName   LastName     HireDate
0     Nancy    Davolio  1/5/10 0:00
1     Janet  Leverling  1/4/10 0:00
2  Margaret    Peacock  3/5/11 0:00

## 5. Show all of the orders and order dates for those placed by Employee ID 5

In [41]:
query = """
        SELECT
            OrderID,
            OrderDate    
        FROM Orders
        WHERE EmployeeID = '5' LIMIT 5

        """
print(sqldf(query,locals()))

   OrderID      OrderDate
0    10248    4/7/14 8:00
1    10254   11/7/14 2:00
2    10269   31/7/14 0:00
3    10297   4/9/14 21:00
4    10320  3/10/14 12:00

## 6. Show the SupplierID, ContactName and ContactTitle for suppliers whose ContactTitle is *not* Marketing Manager

In [43]:
query = """
        SELECT
            SupplierID,
            ContactName,
            ContactTitle
        FROM Suppliers
        WHERE ContactTitle <> 'Marketing Manager' LIMIT 5

        """
print(sqldf(query,locals()))

   SupplierID                 ContactName              ContactTitle
0           1            Charlotte Cooper        Purchasing Manager
1           2               Shelley Burke       Order Administrator
2           3               Regina Murphy      Sales Representative
3           5  Antonio del Valle Saavedra      Export Administrator
4           6                 Mayumi Ohno  Marketing Representative

## 7. Return the ProductID and ProductName for products where the ProductName includes the string "queso"

In [49]:
query = """
        SELECT
            ProductID,
            ProductName           
        FROM Products
        WHERE ProductName LIKE '%queso%'

        """
print(sqldf(query,locals()))

   ProductID                ProductName
0         11             Queso Cabrales
1         12  Queso Manchego La Pastora

## 8. Return the OrderID, CustomerID and ShipCountry where the ShipCountry is either Belgium or France

In [51]:
query = """
        SELECT
            OrderID,
            CustomerID,
            ShipCountry
        FROM Orders
        WHERE ShipCountry = 'France' OR ShipCountry = 'Belgium' LIMIT 5

        """
print(sqldf(query,locals()))

   OrderID CustomerID ShipCountry
0    10248      VINET      France
1    10251      VICTE      France
2    10252      SUPRD     Belgium
3    10265      BLONP      France
4    10274      VINET      France

## 9. Return the OrderID, CustomerID and ShipCountry for orders from any Latin American country (Brazil, Mexico, Argentina & Venezuela)

In [53]:
query = """
        SELECT
            OrderID,
            CustomerID,
            ShipCountry
        FROM Orders
        WHERE ShipCountry IN ('Brazil','Mexico','Argentina','Venezuela') LIMIT 5

        """
print(sqldf(query,locals()))

   OrderID CustomerID ShipCountry
0    10250      HANAR      Brazil
1    10253      HANAR      Brazil
2    10256      WELLI      Brazil
3    10257      HILAA   Venezuela
4    10259      CENTC      Mexico

## 10. Return FirstName, LastName, Title and BirthDate for all employees and order by birthdate in ascending order

In [72]:
query = """
        SELECT
            FirstName,
            LastName,
            Title,
            BirthDate
        FROM Employees
        ORDER BY BirthDate

        """
print(sqldf(query,locals()))

  FirstName   LastName                     Title                   Birthdate
0  Margaret    Peacock      Sales Representative  1955-09-19 00:00:00.000000
1     Nancy    Davolio      Sales Representative  1966-08-12 00:00:00.000000
2    Andrew     Fuller     Vice President, Sales  1970-02-19 00:00:00.000000
3    Steven   Buchanan             Sales Manager  1973-04-03 00:00:00.000000
4     Laura   Callahan  Inside Sales Coordinator  1976-09-01 00:00:00.000000
5    Robert       King      Sales Representative  1978-05-29 00:00:00.000000
6   Michael     Suyama      Sales Representative  1981-02-07 00:00:00.000000
7     Janet  Leverling      Sales Representative  1981-08-30 00:00:00.000000
8      Anne  Dodsworth      Sales Representative  1984-01-27 00:00:00.000000

## 11. Return the query from Q10. showing only the date portion of the BirthDate

In [105]:
query = """
        SELECT
            FirstName,
            LastName,
            Title,
            BirthDate
        FROM Employees
        ORDER BY BirthDate

        """
print(sqldf(query,locals()))

  FirstName   LastName                     Title                   Birthdate
0  Margaret    Peacock      Sales Representative  1955-09-19 00:00:00.000000
1     Nancy    Davolio      Sales Representative  1966-08-12 00:00:00.000000
2    Andrew     Fuller     Vice President, Sales  1970-02-19 00:00:00.000000
3    Steven   Buchanan             Sales Manager  1973-04-03 00:00:00.000000
4     Laura   Callahan  Inside Sales Coordinator  1976-09-01 00:00:00.000000
5    Robert       King      Sales Representative  1978-05-29 00:00:00.000000
6   Michael     Suyama      Sales Representative  1981-02-07 00:00:00.000000
7     Janet  Leverling      Sales Representative  1981-08-30 00:00:00.000000
8      Anne  Dodsworth      Sales Representative  1984-01-27 00:00:00.000000

## 12. Return each employees FirstName, LastName nad new column FullName with both joined together

In [108]:
query = """
        SELECT
            FirstName,
            LastName,
            FirstName || ' '|| LastName AS FullName
        FROM Employees

        """
print(sqldf(query,locals()))

#Or alternative Python implementation below
Employees["FullName"] = Employees.FirstName.str.cat(Employees.LastName, sep=' ')

  FirstName   LastName          FullName
0     Nancy    Davolio     Nancy Davolio
1    Andrew     Fuller     Andrew Fuller
2     Janet  Leverling   Janet Leverling
3  Margaret    Peacock  Margaret Peacock
4    Steven   Buchanan   Steven Buchanan
5   Michael     Suyama    Michael Suyama
6    Robert       King       Robert King
7     Laura   Callahan    Laura Callahan
8      Anne  Dodsworth    Anne Dodsworth